# YOLOv8s with P2 + BiFPN-Lite
# 基于 P2 模型，将 PAN 替换为轻量化的 BiFPN
# BiFPN: 双向特征金字塔网络，改善多尺度特征融合
nc: 10
scales:
  s: [0.33, 0.50, 1024]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32
  - [-1, 3, C2f, [1024, True]]    # 8
  - [-1, 1, SPPF, [1024, 5]]      # 9

# Head with BiFPN-Lite
head:
  # Top-down pathway (first pass)
  - [-1, 1, Conv, [512, 1, 1]]                                    # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                    # 11
  - [[-1, 6], 1, Concat, [1]]                                    # 12 - cat P4
  - [-1, 3, C2f, [512, False]]                                   # 13 - P4_td
  
  - [-1, 1, Conv, [256, 1, 1]]                                    # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                  # 15
  - [[-1, 4], 1, Concat, [1]]                                   # 16 - cat P3
  - [-1, 3, C2f, [256, False]]                                  # 17 - P3_td
  
  # P2 branch
  - [-1, 1, Conv, [128, 1, 1]]                                  # 18
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                  # 19
  - [[-1, 2], 1, Concat, [1]]                                   # 20 - cat P2
  - [-1, 3, C2f, [128, False]]                                  # 21 - P2_td
  
  # Bottom-up pathway (BiFPN fusion with weighted features)
  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]                                  # 22
  - [[-1, 17], 1, Concat, [1]]                                  # 23 - cat P3_td
  - [-1, 3, C2f, [256, False]]                                   # 24 - P3_bu
  
  # P3 -> P4 (BiFPN: fuse P4_td and P3_bu)
  - [-1, 1, Conv, [256, 3, 2]]                                  # 25
  - [[-1, 13], 1, Concat, [1]]                                  # 26 - cat P4_td
  - [-1, 3, C2f, [512, False]]                                   # 27 - P4_bu
  
  # P4 -> P5 (BiFPN: fuse P5 and P4_bu)
  - [-1, 1, Conv, [512, 3, 2]]                                  # 28
  - [[-1, 9], 1, Concat, [1]]                                   # 29 - cat P5
  - [-1, 3, C2f, [1024, False]]                                 # 30 - P5_bu
  
  # Second top-down pass (BiFPN characteristic: repeated fusion)
  - [-1, 1, Conv, [512, 1, 1]]                                  # 31
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                 # 32
  - [[-1, 27], 1, Concat, [1]]                                 # 33 - cat P4_bu
  - [-1, 3, C2f, [512, False]]                                  # 34 - P4_td2
  
  - [-1, 1, Conv, [256, 1, 1]]                                  # 35
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                 # 36
  - [[-1, 24], 1, Concat, [1]]                                 # 37 - cat P3_bu
  - [-1, 3, C2f, [256, False]]                                  # 38 - P3_td2
  
  - [-1, 1, Conv, [128, 1, 1]]                                  # 39
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                 # 40
  - [[-1, 21], 1, Concat, [1]]                                 # 41 - cat P2_td
  - [-1, 3, C2f, [128, False]]                                  # 42 - P2_td2
  
  # Final bottom-up pass
  - [-1, 1, Conv, [128, 3, 2]]                                  # 43
  - [[-1, 38], 1, Concat, [1]]                                 # 44 - cat P3_td2
  - [-1, 3, C2f, [256, False]]                                  # 45 - P3_final
  
  - [-1, 1, Conv, [256, 3, 2]]                                  # 46
  - [[-1, 34], 1, Concat, [1]]                                 # 47 - cat P4_td2
  - [-1, 3, C2f, [512, False]]                                  # 48 - P4_final
  
  - [-1, 1, Conv, [512, 3, 2]]                                  # 49
  - [[-1, 30], 1, Concat, [1]]                                 # 50 - cat P5_bu
  - [-1, 3, C2f, [1024, False]]                                 # 51 - P5_final
  
  # Detect layers: [P2_td2, P3_final, P4_final, P5_final]
  - [[42, 45, 48, 51], 1, Detect, [nc]]                         # 52 - strides: [4, 8, 16, 32]


