# YOLOv8s with P2 detection head (stride 4 added)
# 基于标准 YOLOv8s 结构，添加 P2 检测头以提升小目标检测
nc: 10
scales:
  s: [0.33, 0.50, 1024]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32
  - [-1, 3, C2f, [1024, True]]    # 8
  - [-1, 1, SPPF, [1024, 5]]      # 9

# Head (PANet-like with P2 added)
head:
  # Top-down pathway
  - [-1, 1, Conv, [512, 1, 1]]                                    # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                    # 11
  - [[-1, 6], 1, Concat, [1]]                                    # 12 - cat P4
  - [-1, 3, C2f, [512, False]]                                   # 13 - P4_out
  
  - [-1, 1, Conv, [256, 1, 1]]                                    # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                  # 15
  - [[-1, 4], 1, Concat, [1]]                                   # 16 - cat P3
  - [-1, 3, C2f, [256, False]]                                  # 17 - P3_out
  
  # 新增：从 P3 上采样到 P2
  - [-1, 1, Conv, [128, 1, 1]]                                  # 18
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                  # 19
  - [[-1, 2], 1, Concat, [1]]                                   # 20 - cat P2 (backbone层2)
  - [-1, 3, C2f, [128, False]]                                  # 21 - P2_out
  
  # Bottom-up pathway
  - [-1, 1, Conv, [128, 3, 2]]                                  # 22
  - [[-1, 17], 1, Concat, [1]]                                  # 23 - cat P3_out
  - [-1, 3, C2f, [256, False]]                                  # 24 - P3_final
  
  - [-1, 1, Conv, [256, 3, 2]]                                  # 25
  - [[-1, 13], 1, Concat, [1]]                                  # 26 - cat P4_out
  - [-1, 3, C2f, [512, False]]                                  # 27 - P4_final
  
  - [-1, 1, Conv, [512, 3, 2]]                                  # 28
  - [[-1, 9], 1, Concat, [1]]                                   # 29 - cat P5 (backbone SPPF)
  - [-1, 3, C2f, [1024, False]]                                 # 30 - P5_final
  
  # Detect layers: [P2_out, P3_final, P4_final, P5_final]
  - [[21, 24, 27, 30], 1, Detect, [nc]]         # 31 - strides自动计算为[4, 8, 16, 32]
