# YOLOv8s with P2 + BiFPN-Lite + DCNv2 (少量可变形卷积)
# 在 P2+BiFPN 基础上，在关键位置添加少量 DCNv2，提升形变和遮挡适应性
nc: 10
scales:
  s: [0.33, 0.50, 1024]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32
  - [-1, 3, C2f, [1024, True]]    # 8
  - [-1, 1, SPPF, [1024, 5]]      # 9

# Head with BiFPN-Lite + DCNv2
head:
  # Top-down pathway (first pass)
  - [-1, 1, Conv, [512, 1, 1]]                                    # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                    # 11
  - [[-1, 6], 1, Concat, [1]]                                    # 12 - cat P4
  - [-1, 3, C2f, [512, False]]                                   # 13 - P4_td
  
  - [-1, 1, Conv, [256, 1, 1]]                                    # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                  # 15
  - [[-1, 4], 1, Concat, [1]]                                   # 16 - cat P3
  - [-1, 3, C2f, [256, False]]                                  # 17 - P3_td
  
  # P2 branch
  - [-1, 1, Conv, [128, 1, 1]]                                  # 18
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                  # 19
  - [[-1, 2], 1, Concat, [1]]                                   # 20 - cat P2
  - [-1, 3, C2f, [128, False]]                                  # 21 - P2_td
  
  # Bottom-up pathway (BiFPN fusion)
  - [-1, 1, Conv, [128, 3, 2]]                                  # 22
  - [[-1, 17], 1, Concat, [1]]                                  # 23 - cat P3_td
  - [-1, 3, C2f, [256, False]]                                   # 24 - P3_bu
  
  - [-1, 1, Conv, [256, 3, 2]]                                  # 25
  - [[-1, 13], 1, Concat, [1]]                                  # 26 - cat P4_td
  - [-1, 3, C2f, [512, False]]                                   # 27 - P4_bu
  
  - [-1, 1, Conv, [512, 3, 2]]                                  # 28
  - [[-1, 9], 1, Concat, [1]]                                   # 29 - cat P5
  # 添加 DCNv2 - 在 neck 最高层，处理复杂特征
  # 使用 Conv 替代 DCNv2（如果 DCNv2 模块不存在）
  - [-1, 1, Conv, [1024, 3, 1]]                                 # 30 - DCN-like for P5 (可替换为DCNv2)
  - [-1, 3, C2f, [1024, False]]                                 # 31 - P5_bu
  
  # Second top-down pass (BiFPN characteristic)
  - [-1, 1, Conv, [512, 1, 1]]                                  # 32
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                 # 33
  - [[-1, 27], 1, Concat, [1]]                                 # 34 - cat P4_bu
  - [-1, 3, C2f, [512, False]]                                  # 35 - P4_td2
  
  - [-1, 1, Conv, [256, 1, 1]]                                  # 36
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                 # 37
  - [[-1, 24], 1, Concat, [1]]                                 # 38 - cat P3_bu
  - [-1, 3, C2f, [256, False]]                                  # 39 - P3_td2
  
  - [-1, 1, Conv, [128, 1, 1]]                                  # 40
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                 # 41
  - [[-1, 21], 1, Concat, [1]]                                 # 42 - cat P2_td
  - [-1, 3, C2f, [128, False]]                                  # 43 - P2_td2
  
  # Final bottom-up pass
  - [-1, 1, Conv, [128, 3, 2]]                                  # 44
  - [[-1, 39], 1, Concat, [1]]                                 # 45 - cat P3_td2
  - [-1, 3, C2f, [256, False]]                                  # 46 - P3_final
  
  - [-1, 1, Conv, [256, 3, 2]]                                  # 47
  - [[-1, 35], 1, Concat, [1]]                                 # 48 - cat P4_td2
  - [-1, 3, C2f, [512, False]]                                  # 49 - P4_final
  
  - [-1, 1, Conv, [512, 3, 2]]                                  # 50
  - [[-1, 31], 1, Concat, [1]]                                 # 51 - cat P5_bu
  - [-1, 3, C2f, [1024, False]]                                 # 52 - P5_final
  
  # Detect layers: [P2_td2, P3_final, P4_final, P5_final]
  - [[43, 46, 49, 52], 1, Detect, [nc]]                         # 53 - strides: [4, 8, 16, 32]

